AuroraRocketryTeam/atlas/sdkconfig.defaults
# Atlas ESP-IDF — Default SDK configuration
# Target: ESP32-S3 (Arduino Nano ESP32)
CONFIG_IDF_TARGET="esp32s3"

# C++ exceptions and RTTI (Required for Arduino libraries)
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y

# Enable C++17
CONFIG_COMPILER_CXX_STANDARD_CXX17=y
CONFIG_COMPILER_CXX_STANDARD="c++17"

# FreeRTOS (Must be 1000 for Arduino's delay() and millis() to be accurate)
CONFIG_FREERTOS_HZ=1000

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- ARDUINO COMPONENT INTEGRATION ---

# Disable Arduino autostart so we can use app_main() as the entry point
CONFIG_AUTOSTART_ARDUINO=n

# Partition table — default single factory app
CONFIG_PARTITION_TABLE_SINGLE_APP=y